Tekla.Structures.Geometry3d.PolycurveGeometryBuilder
The polycurve geometry builder class is in charge of building the geometry list of a polycurve. All the
geometries that the builder connects must be connected on the correct end points. The builder has a fluent
interface, and can be used as follows:
using Tekla.Structures.Geometry3d;
using Tekla.Structures.Model;
public class Example
{
static void Main(string[] args)
{
var segment = new LineSegment(new Point(0, 0, 0), new Point(1000, 0, 0));
var arc = new Arc(new Point(1000, 0, 0), new Point(2000, 1000, 0), new Point(1707.1, 292.89, 0));
var geometryList = new PolycurveGeometrySolver().Append(arc).Append(segment).GetPolycurve();
var polycurve = new ControlPolycurve();
polycurve.Geometry = geometryList;
polycurve.Insert();
}
}

Tekla.Structures.Geometry3d.PolycurveGeometryBuilder.finalGeometry
Contains the built geometry.

Tekla.Structures.Geometry3d.PolycurveGeometryBuilder.NonConnectedMessage
Message to be sent when an exception of non connected geometry is thrown

Tekla.Structures.Geometry3d.PolycurveGeometryBuilder.#ctor
Creates an empty geometry builder. This builder contains no geometries

Tekla.Structures.Geometry3d.PolycurveGeometryBuilder.#ctor(Tekla.Structures.Geometry3d.Polycurve)
Constructs a geometry builder from an existing geometry list
geometries: Initial geometry list

Tekla.Structures.Geometry3d.PolycurveGeometryBuilder.GetPolycurve
Gets the final geometry after all the modifications made by the builder
Returns: The final geometry list

Tekla.Structures.Geometry3d.PolycurveGeometryBuilder.Append(Tekla.Structures.Geometry3d.Arc)
Appends an arc to the geometry list
arc: Geometry to append
Throws System.ArgumentException: Thrown if input geometry is not connected to the polycurve
Returns: The builder itself

Tekla.Structures.Geometry3d.PolycurveGeometryBuilder.Append(Tekla.Structures.Geometry3d.LineSegment)
Appends a line segment to the geometry list
segment: Geometry to append
Throws System.ArgumentException: Thrown if input geometry is not connected to the polycurve
Returns: The builder itself

Tekla.Structures.Geometry3d.PolycurveGeometryBuilder.Append(Tekla.Structures.Geometry3d.Polycurve)
Appends another polycurve to the geometry list
otherPolycurve: Polycurve to add to the list
Returns: The builder itself

Tekla.Structures.Geometry3d.PolycurveGeometryBuilder.AppendArc(Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Point)
Appends an arc using three points. The first point is taken as the last point of the last element of the
polycurve.
Remarks:
This function requires that there is at least one curve in the polycurve
middlePoint: Arc middle point
endPoint: Arc end point
Returns: The builder itself

Tekla.Structures.Geometry3d.PolycurveGeometryBuilder.AppendSegment(Tekla.Structures.Geometry3d.Point)
Appends an line segment. The first point is taken as the last point of the last element of the polycurve.
Remarks:
This function requires that there is at least one curve in the polycurve
endPoint: Segment end point
Returns: The builder itself

Tekla.Structures.Geometry3d.PolycurveGeometryBuilder.AppendTangentArc(Tekla.Structures.Geometry3d.Point)
Appends an arc tangent to the last curve of the curve list.
Remarks:
This function requires that there is at least one curve in the polycurve
endPoint: End point of the arc
Returns: The builder itself

Tekla.Structures.Geometry3d.PolycurveGeometryBuilder.AppendTangentSegment(System.Double)
Appends a line segment of the given length tangent to the last curve of the list.
Remarks:
This function requires that there is at least one curve in the polycurve
length: Length of the segment to append
Returns: The builder itself

Tekla.Structures.Geometry3d.PolycurveGeometryBuilder.Prepend(Tekla.Structures.Geometry3d.Arc)
Prepends an arc to the geometry list
arc: Geometry to prepend
Returns: The builder itself

Tekla.Structures.Geometry3d.PolycurveGeometryBuilder.Prepend(Tekla.Structures.Geometry3d.LineSegment)
Prepends a line segment to the geometry list
segment: Geometry to prepend
Returns: The builder itself

Tekla.Structures.Geometry3d.PolycurveGeometryBuilder.PrependArc(Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Point)
Prepends an arc using three points. The last point is taken as the start point of the first element of the
polycurve.
Remarks:
This function requires that there is at least one curve in the polycurve
startPoint: Arc start point
middlePoint: Arc middle point
Returns: The builder itself

Tekla.Structures.Geometry3d.PolycurveGeometryBuilder.PrependSegment(Tekla.Structures.Geometry3d.Point)
Prepends an line segment. The last point is taken as the start point of the first element of the polycurve.
Remarks:
This function requires that there is at least one curve in the polycurve
startPoint: Segment start point
Returns: The builder itself

Tekla.Structures.Geometry3d.PolycurveGeometryBuilder.PrependTangentArc(Tekla.Structures.Geometry3d.Point)
Prepends an arc tangent to the first curve of the curve list.
Remarks:
This function requires that there is at least one curve in the polycurve
startPoint: Start point of the arc
Returns: The builder itself

Tekla.Structures.Geometry3d.PolycurveGeometryBuilder.PrependTangentSegment(System.Double)
Prepends a line segment of the given length tangent to the first curve of the list.
Remarks:
This function requires that there is at least one curve in the polycurve
length: Length of the segment to append
Returns: The builder itself

Tekla.Structures.Geometry3d.PolycurveGeometryBuilder.Replace(System.Int32,Tekla.Structures.Geometry3d.Arc)
Replaces the geometry at a given index
index: Index of the geometry to replace
arc: Geometry to insert in place of the existing one
Returns: The builder itself

Tekla.Structures.Geometry3d.PolycurveGeometryBuilder.Replace(System.Int32,Tekla.Structures.Geometry3d.LineSegment)
Replaces the geometry at a given index
index: Index of the geometry to replace
segment: Geometry to insert in place of the existing one
Returns: The builder itself

Tekla.Structures.Geometry3d.PolycurveGeometryBuilder.GetEndTangentDirection(Tekla.Structures.Geometry3d.ICurve)
Calculates the direction of the tangent to the end point of the given curve
curve: Input curve
Returns: Tangent direction pointing towards outside the polycurve

Tekla.Structures.Geometry3d.PolycurveGeometryBuilder.GetStartTangentDirection(Tekla.Structures.Geometry3d.ICurve)
Calculates the direction of the tangent to the start point of the given curve
curve: Input curve
Returns: Tangent direction pointing towards outside the polycurve

Tekla.Structures.Geometry3d.PolycurveGeometryBuilder.Append(Tekla.Structures.Geometry3d.ICurve)
Appends a curve to the list
curve: Curve to append
Returns: The builder itself

Tekla.Structures.Geometry3d.PolycurveGeometryBuilder.Prepend(Tekla.Structures.Geometry3d.ICurve)
Prepends a curve to the list
curve: Curve to prepend
Returns: The builder itself

Tekla.Structures.Geometry3d.PolycurveGeometryBuilder.IsCurveConnectedToNeighbors(System.Int32,Tekla.Structures.Geometry3d.ICurve)
Determines whether a curve is connected to the neighbors of the given index
index: Index of the reference curve whose neighbors are to be checked
curve: Curve to check connectedness
Returns: True if the curve is connected to the neighbors of the index, false otherwise

Tekla.Structures.Geometry3d.PolycurveGeometryBuilder.Replace(System.Int32,Tekla.Structures.Geometry3d.ICurve)
Replaces the geometry at a given index
index: Index of the geometry to replace
curveToInsert: Geometry to insert in place of the existing one
Returns: The builder itself